devdoc/牛天睿/niwtr.swtch.org
# -*- mode: org; -*-

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>

#+HTML_HEAD: <script src="https://ajax.googleapis.com/ajax/libs/jquery/2.1.3/jquery.min.js"></script>
#+HTML_HEAD: <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.4/js/bootstrap.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="styles/lib/js/jquery.stickytableheaders.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="styles/readtheorg/js/readtheorg.js"></script>

* 我们的初期工作
本文是我工作总结的一部分。按照分工结果，在第一阶段我负责的内容应当有：

1. 系统顶层设计。
2. 引导。
3. 进程数据结构设计。
4. 系统调用设计。

其中“系统顶层设计”需要对操作系统的概念有全面的理解，我已经计划把它总结为另一篇文章。“引导”方面由我和 /刘含/ 共同商量完成。
我的前两个任务都是属于概要设计方面，而后两者则是属于详细设计。详细设计要求具体到设计本身，比如需要设计进程，就需要落实到进程究竟需要哪些东西。
这些内容显然需要对进程调度方面有完全的了解。并且最后一项“系统调用设计”还需要对“中断”有完全的了解。关于这点，
我本身和 /李凌璇/ 同学属于一组（按照 *yonix* 小组的规定，组内再分组），因此我决定在初期先和 /李凌璇/ 共同先把CPU调度和中断的内容研究透彻，再来进行自己的那份工作。
因此从初期工作来看，我和 /李凌璇/ 同学做的内容基本一致，但是我们侧重点不同——我需要研究更多的有关中断、进程表示和进程运行模式（内核态、用户态）的内容，而 *她* 则更加侧重于
CPU调度算法。因此在中期验收的时候，我们对自己的工作各有不同的期望，在完成CPU进程方面的编码工作以后， *她* 希望能单独做出一个有关红黑树和静态CPU调度的演示程序，我则更希望
自己的工作能够先 *融合* 进我们的教材—— *xv6* 里，以验证我对操作系统全局的理解。



* swtch
#+begin_src c
void swtch(struct context ** old , struct context * new);
#+end_src

swtch负责上下文切换。它要做的事情有：
1. 把上下文信息（ebp、ebx、esi、edi、eip、esp）保存在old指向的上下文结构体里。
2. 从new里面恢复寄存器（上下文）。


#+begin_src asm
  # Save old callee-save registers
  # eip在哪里？——eip在使用call调用swtch的时候就保存在栈中%ebp之上的位置上了
 

  # Switch stacks

  movl %edx, %esp # new->stack重置栈

  # Load new callee-save registers
  popl %edi
  popl %esi
  popl %ebx
  popl %ebp
  ret # pop %eip
rc asm
#+end_src

首先它从栈里面弹出两个参数到eax和edx。

#+begin_src asm
.globl swtch
swtch:
  movl 4(%esp), %eax # old
  movl 8(%esp), %edx # new
#+end_src

把所有的一堆寄存器压栈。这里有ebp、ebx、esi、edi，但是没有eip。实际上eip早在caller
调用swtch的时候就已经把它压栈了，因此它现在刚好处在ebp之下的位置。该过程由
call指令自动完成。

#+begin_src asm
  pushl %ebp
  pushl %ebx
  pushl %esi
  pushl %edi
#+end_src

随后，它把栈指针赋给eax所指向的参数地址。其实也就相当于把当前的栈指针赋值给old参数。注意old参数是一个指针的指针，这里的第二个“指针”就是指esp。
#+begin_src asm
movl %esp, (%eax) # 把esp保存。
#+end_src

现在格局如下：
#+BEGIN_SRC c
                                                                                       
  +-----------------------+                      +-----------------------+             
  |          eax          |                      |          edx          |             
  +-------+---------------+                      +---+-------------------+             
          |                                          |                                 
          |                                          |                                 
          |                                          |                                 
          |                                          |                                 
          |                                          |                                 
          |                                          |                                 
          |                                          |                                 
          |                                          |                                 
          v                                          |                                 
   +------------+                                    |                                 
   |    esp     |                                    |                                 
   +------------+--->+------------------------+      +------->------------------------+
                     |          edi           |              |        edi(new)        |
                     +------------------------+              +------------------------+
                     |          esi           |              |        esi(new)        |
                     +------------------------+              +------------------------+
                     |          ebx           |              |        ebx(new)        |
                     +------------------------+              +------------------------+
                     |          ebp           |              |        ebp(new)        |
                     +------------------------+              +------------------------+
                     |          eip           |              |        eip(new)        |
                     +------------------------+              +------------------------+
                  
#+end_src


如果把swtch过程看做是“save”和“load”两个过程的结合，那么上面所做的工作就是save的全部了，save把当前寄存器（上下文）的内容压栈，
把栈指针保存下来。接下来还需要load工作，它负责恢复新的上下文。新的上下文也是之前通过相同的save工作保存下来的，因此它一定是指向某个内存区域的“栈指针”。我们把
这个指针取出来作为新的栈指针，然后按序（这里是倒着的哦！）把新的上下文从栈里弹出来保存在寄存器里。这里load的工作就结束了。
——注意栈的IO次序是反着的，因此我们pop的时候要按照push相反的次序。

在最后，一句 =ret= 就相当于popl %eip， 它可以把程序计数器eip的值从栈里弹出。这就是内核上下文切换——swtch的全部了。

*注意： 这里是ret而不是iret。* 这是一个很有趣的现象。它将会向我们揭示一个很容易让人混淆的假象，“上下文切换”的大幕将就此徐徐展开……


