devdoc/牛天睿/niwtr.swtch.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-04-14 Fri 21:33 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="牛天睿" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. 我们的初期工作</a></li>
<li><a href="#orgheadline2">2. swtch</a></li>
<li><a href="#orgheadline3">3. 上下文切换</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> 我们的初期工作</h2>
<div class="outline-text-2" id="text-1">
<p>
本文是我工作总结的一部分。按照分工结果，在第一阶段我负责的内容应当有：
</p>

<ol class="org-ol">
<li>系统顶层设计。</li>
<li>引导。</li>
<li>进程数据结构设计。</li>
<li>系统调用设计。</li>
</ol>

<p>
其中“系统顶层设计”需要对操作系统的概念有全面的理解，我已经计划把它总结为另一篇文章。“引导”方面由我和 <i>刘含</i> 共同商量完成。
我的前两个任务都是属于概要设计方面，而后两者则是属于详细设计。详细设计要求具体到设计本身，比如需要设计进程，就需要落实到进程究竟需要哪些东西。
这些内容显然需要对进程调度方面有完全的了解。并且最后一项“系统调用设计”还需要对“中断”有完全的了解。关于这点，
我本身和 <i>李凌璇</i> 同学属于一组（按照 <b>yonix</b> 小组的规定，组内再分组），因此我决定在初期先和 <i>李凌璇</i> 共同先把CPU调度和中断的内容研究透彻，再来进行自己的那份工作。
因此从初期工作来看，我和 <i>李凌璇</i> 同学做的内容基本一致，但是我们侧重点不同——我需要研究更多的有关中断、进程表示和进程运行模式（内核态、用户态）的内容，而 <b>她</b> 则更加侧重于
CPU调度算法。因此在中期验收的时候，我们对自己的工作各有不同的期望，在完成CPU进程方面的编码工作以后， <b>她</b> 希望能单独做出一个有关红黑树和静态CPU调度的演示程序，我则更希望
自己的工作能够先 <b>融合</b> 进我们的教材—— <b>xv6</b> 里，以验证我对操作系统全局的理解。
</p>
</div>
</div>



<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> swtch</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #6434A3;">void</span> <span style="color: #006699;">swtch</span><span style="color: #ff00ff;">(</span><span style="color: #0000FF;">struct</span> <span style="color: #6434A3;">context</span> ** <span style="color: #BA36A5;">old</span> , <span style="color: #0000FF;">struct</span> <span style="color: #6434A3;">context</span> * <span style="color: #BA36A5;">new</span><span style="color: #ff00ff;">)</span>;
</pre>
</div>

<p>
swtch负责上下文切换。它要做的事情有：
</p>
<ol class="org-ol">
<li>把上下文信息（ebp、ebx、esi、edi、eip、esp）保存在old指向的上下文结构体里。</li>
<li>从new里面恢复寄存器（上下文）。</li>
</ol>


<div class="org-src-container">

<pre class="src src-asm">  # Save old callee-save registers
  # eip&#22312;&#21738;&#37324;&#65311;&#8212;&#8212;eip&#22312;&#20351;&#29992;call&#35843;&#29992;swtch&#30340;&#26102;&#20505;&#23601;&#20445;&#23384;&#22312;&#26632;&#20013;<span style="color: #BA36A5;">%ebp&#20043;&#19978;&#30340;&#20301;&#32622;&#19978;&#20102;</span>


  # Switch stacks

  <span style="color: #0000FF;">movl</span> <span style="color: #BA36A5;">%edx</span>, <span style="color: #BA36A5;">%esp</span> # new-&gt;stack&#37325;&#32622;&#26632;

  # Load new callee-save registers
  <span style="color: #0000FF;">popl</span> <span style="color: #BA36A5;">%edi</span>
  <span style="color: #0000FF;">popl</span> <span style="color: #BA36A5;">%esi</span>
  <span style="color: #0000FF;">popl</span> <span style="color: #BA36A5;">%ebx</span>
  <span style="color: #0000FF;">popl</span> <span style="color: #BA36A5;">%ebp</span>
  <span style="color: #0000FF;">ret</span> # pop <span style="color: #BA36A5;">%eip</span>
<span style="color: #006699;">rc</span> <span style="color: #0000FF;">asm</span>
</pre>
</div>

<p>
首先它从栈里面弹出两个参数到eax和edx。
</p>

<div class="org-src-container">

<pre class="src src-asm"><span style="color: #0000FF;">.globl</span> swtch
<span style="color: #006699;">swtch</span>:
  <span style="color: #0000FF;">movl</span> 4<span style="color: #ff00ff;">(</span><span style="color: #BA36A5;">%esp</span><span style="color: #ff00ff;">)</span>, <span style="color: #BA36A5;">%eax</span> # old
  <span style="color: #0000FF;">movl</span> 8<span style="color: #ff00ff;">(</span><span style="color: #BA36A5;">%esp</span><span style="color: #ff00ff;">)</span>, <span style="color: #BA36A5;">%edx</span> # new
</pre>
</div>

<p>
把所有的一堆寄存器压栈。这里有ebp、ebx、esi、edi，但是没有eip。实际上eip早在caller
调用swtch的时候就已经把它压栈了，因此它现在刚好处在ebp之下的位置。该过程由
call指令自动完成。
</p>

<div class="org-src-container">

<pre class="src src-asm"><span style="color: #006699;">pushl</span> <span style="color: #0000FF;">%ebp</span>
<span style="color: #006699;">pushl</span> <span style="color: #0000FF;">%ebx</span>
<span style="color: #006699;">pushl</span> <span style="color: #0000FF;">%esi</span>
<span style="color: #006699;">pushl</span> <span style="color: #0000FF;">%edi</span>
</pre>
</div>

<p>
随后，它把栈指针赋给eax所指向的参数地址。其实也就相当于把当前的栈指针赋值给old参数。注意old参数是一个指针的指针，这里的第二个“指针”就是指esp。
</p>
<div class="org-src-container">

<pre class="src src-asm"><span style="color: #006699;">movl</span> <span style="color: #0000FF;">%esp</span>, <span style="color: #ff00ff;">(</span><span style="color: #BA36A5;">%eax</span><span style="color: #ff00ff;">)</span> # &#25226;esp&#20445;&#23384;&#12290;
</pre>
</div>

<p>
现在格局如下：
</p>
<div class="org-src-container">

<pre class="src src-c">+-----------------------+                      +-----------------------+             
|          eax          |                      |          edx          |             
+-------+---------------+                      +---+-------------------+             
        |                                          |                                 
        |                                          |                                 
        |                                          |                                 
        |                                          |                                 
        |                                          |                                 
        |                                          |                                 
        |                                          |                                 
        |                                          |                                 
        v                                          |                                 
 +------------+                                    |                                 
 |    esp     |                                    |                                 
 +------------+---&gt;+------------------------+      +-------&gt;------------------------+
                   |          edi           |              |        edi<span style="color: #ff00ff;">(</span>new<span style="color: #ff00ff;">)</span>        |
                   +------------------------+              +------------------------+
                   |          esi           |              |        esi<span style="color: #ff00ff;">(</span>new<span style="color: #ff00ff;">)</span>        |
                   +------------------------+              +------------------------+
                   |          ebx           |              |        ebx<span style="color: #ff00ff;">(</span>new<span style="color: #ff00ff;">)</span>        |
                   +------------------------+              +------------------------+
                   |          ebp           |              |        ebp<span style="color: #ff00ff;">(</span>new<span style="color: #ff00ff;">)</span>        |
                   +------------------------+              +------------------------+
                   |          eip           |              |        eip<span style="color: #ff00ff;">(</span>new<span style="color: #ff00ff;">)</span>        |
                   +------------------------+              +------------------------+
</pre>
</div>


<p>
如果把swtch过程看做是“save”和“load”两个过程的结合，那么上面所做的工作就是save的全部了，save把当前寄存器（上下文）的内容压栈，
把栈指针保存下来。接下来还需要load工作，它负责恢复新的上下文。新的上下文也是之前通过相同的save工作保存下来的，因此它一定是指向某个内存区域的“栈指针”。我们把
这个指针取出来作为新的栈指针，然后按序（这里是倒着的哦！）把新的上下文从栈里弹出来保存在寄存器里。这里load的工作就结束了。
——注意栈的IO次序是反着的，因此我们pop的时候要按照push相反的次序。
</p>

<p>
在最后，一句 <code>ret</code> 就相当于popl %eip， 它可以把程序计数器eip的值从栈里弹出。这就是内核上下文切换——swtch的全部了。
</p>

<p>
<b>注意： 这里是ret而不是iret。</b> 这是一个很有趣的现象。它将会向我们揭示一个很容易让人混淆的假象，“上下文切换”的大幕将就此徐徐展开……
</p>
</div>
</div>
